Opening completely removes its host
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId OpeningCutAll { get; }
  Visual Basic
Public Shared ReadOnly Property OpeningCutAll As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ OpeningCutAll {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures OpeningFailures Class
  Autodesk.Revit.DB Namespace